In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({"cust_id": ["C1", "C2", "C3", "C4", "C5", "C6", "C7", "C8", "C9", "C10"],
                   "item_bought": [10, 15, 20, 35, 4, 10, 2, 0, 9, 15],
                   "city": ["Bandung", "Jakarta", "Bogor", "Tangerang", "Bali", "Jakarta", "Jakarta", "Bandung", "Bogor", "Jakarta"]
                  })
df

  cust_id  item_bought       city
0      C1           10    Bandung
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
4      C5            4       Bali
5      C6           10    Jakarta
6      C7            2    Jakarta
7      C8            0    Bandung
8      C9            9      Bogor
9     C10           15    Jakarta

### loc

In [25]:
# single value
df.loc[0]

cust_id             C1
item_bought         10
city           Bandung
Name: 0, dtype: object

In [26]:
# single value
df.loc[0, "cust_id"]

'C1'

In [27]:
# single value
df.loc[0, ["city", "item_bought"]]

city           Bandung
item_bought         10
Name: 0, dtype: object

In [28]:
# single value
df.loc[0, "item_bought"]

np.int64(10)

In [24]:
# range of values
df.loc[0:4, "cust_id"]

0    C1
1    C2
2    C3
3    C4
4    C5
Name: cust_id, dtype: object

In [23]:
# range of values
df.loc[0:4, ["cust_id", "city"]]

  cust_id       city
0      C1    Bandung
1      C2    Jakarta
2      C3      Bogor
3      C4  Tangerang
4      C5       Bali

### iloc

In [16]:
# single value
df.iloc[0, 0]

'C1'

In [17]:
# single value
df.iloc[2, 2]

'Bogor'

In [18]:
# range of values
df.iloc[0:2]

  cust_id  item_bought     city
0      C1           10  Bandung
1      C2           15  Jakarta

In [22]:
# range of values
df.iloc[0:2, 0]

0    C1
1    C2
Name: cust_id, dtype: object

In [20]:
# range of values
df.iloc[0:2, 0:2]

  cust_id  item_bought
0      C1           10
1      C2           15